I do have the same issue with TF Version 1.7.3 and azurerm-provider 3.94.0 on an update of an existing Storage Account. Deploying a new storage account with the same settings works as expected.

TF Plan looks like this (internals removed): 

> Terraform will perform the following actions:
> 
>   # module.some_sa[0].azurerm_storage_account.this will be updated in-place
>   ~ resource "azurerm_storage_account" "this" {
>         id                                = "/subscriptions/<subscription-id-removed>/resourceGroups/rg-infr-some-weu-prod/providers/Microsoft.Storage/storageAccounts/pbbsainfrsgweuprod"
>         name                              = "pbbsainfrsgweuprod"
>         tags                              = {}
>         # (40 unchanged attributes hidden)
> 
>       + customer_managed_key {
>           + key_vault_key_id          = "https://<kvuri-removed>.vault.azure.net/keys/cmk-pbbsainfrsgweuprod"
>           + user_assigned_identity_id = "/subscriptions/<subscription-id-removed>/resourceGroups/rg-infr-some-weu-prod/providers/Microsoft.ManagedIdentity/userAssignedIdentities/uid-pbbsainfrsgweuprod"
>         }
> 
>       ~ identity {
>           ~ identity_ids = [
>               + "/subscriptions/<subscription-id-removed>/resourceGroups/rg-infr-some-weu-prod/providers/Microsoft.ManagedIdentity/userAssignedIdentities/uid-pbbsainfrsgweuprod",
>             ]
>           ~ type         = "SystemAssigned" -> "SystemAssigned, UserAssigned"
>             # (2 unchanged attributes hidden)
>         }
> 
>         # (4 unchanged blocks hidden)
>     }
> 
>   # module.azure_devops_agent[0].module.key_vault.data.azurerm_client_config.current will be read during apply
>   # (depends on a resource or a module with changes pending)
>  <= data "azurerm_client_config" "current" {
>       + client_id       = (known after apply)
>       + id              = (known after apply)
>       + object_id       = (known after apply)
>       + subscription_id = (known after apply)
>       + tenant_id       = (known after apply)
>     }
> 
> Plan: 0 to add, 1 to change, 0 to destroy.

